# Markdown

## 제목 `#`

```markdown
# Heading(h1)
## h2
### h3
#### h4
##### h5
###### h6
```

## 목록

### 순서가 있는 목록 (Ordered List) `1.`

1. 순서가 있는 목록
2. 전부 1로 하는 게 정배

### 순서가 없는 목록 (Unordered List) `-`

- SQL
- Python
- Langchain
- LLM

### 들여쓰기 `Tab`

각종 하위 목록 작성에 사용

들여쓰기를 취소하는건 Shift + Tab

## 텍스트 꾸미기

### 굵게 `**`

굵게는 **굵게**

### 이탤릭 `*`

이탤릭은 *이탤릭*

### 취소선 `~~`

취소선은 ~~취소선~~

### 코드강조 ```

코드 강조는 `코드 강조` (`는 backtick이라고 부름)

## 블럭 삽입

### 코드블럭 삽입 `````

```python
# 여기는 코드블럭
def hi():
    return "Hello World" 
```

- ``` 뒤에 py 붙이면 파이썬 코드, sql 붙이면 SQL 등등

```sql
SELECT * FROM users;
```

### 수식블럭 `$$`

LaTex 문법 쓸일없음

$$
\bar{x} = \frac{1}{n} \sum_{i=1}^{n} x_i
$$

### 인용문 `>`

> 일단 유명해 져라 그러면 ~~검열됨~~ 박수를 받는다
> 

### 표(Table) `|`

|---|는 구분선

| 이름 | 전공 | 취미 |
| --- | --- | --- |
| 111 | 화학 | 여행 |
| 222 | **컴공** | `코딩` |

## 기타

### 줄바꿈

마크다운에서는
줄바꿈 한번은 줄바꿈 아님

줄바꿈 두번 하면 줄을 바꿔줌

### 가로선 `---`

---

### 링크 `[제목](링크 주소)`

- [구글](https://google.com)
- 이미지 삽입은 앞에 느낌표 사용
- 구글에서 이미지 복사할 때는 썸네일 말고 한번 눌러서 이미지 주소 복사하기